Tekla.Structures.Drawing.TextFile.TextFileAttributes.LineType
Gets or sets the line type.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.TextFile.TextFileAttributes.Frame
Gets or sets the frame.